# str_1 = 'слово ещё одно слово'

# print(str_1[:8:-1])

#////////////////////////////////////

# метод .split делит нашу строку по проблеам (по умолчанию) и сохраняет строку в список
# string = "Питон, охуенный - питон"
# print(string.split())

#///////////////////////////////////
# метод repleace() заменяет букву в строке. Мы передаем 2 аргумента, ккаакую букву заменить и на какую

# string = "Питон, охуенный - питон"
# print(string.replace('п', 'П'))

#//////////////////////////////////////
# ленивый оператор / while true и оператор if/ 

# while True:
#     number = input('Введите число: ')
#     if number.isdigit() and int(number) != 0: # проверяет введенное число что это число и проверяет чтобы число не было равно 0
#         print(100/int(number))

#////////////////////////////////////////

# тернарный оператор
# сначала пишем условие при выполнении, потом if, потом условие при невыполнеии

# number = 5
# number = 'Четное' if number % 2 == 0 else 'Нечетное'
# print(number)

#////////////////////////////////////////////////////////

# булевые операции + тернарный оператор
# значение "не" умножается на конструкцию(number % 2 != 0) (получается 1 или 0) елси оно истина True
# и складывается с контрукцией "четное" или выводится просто "четное" елси первое условие не выполняется

# number = 61
# print('не' * (number % 2 != 0) + 'четное' )

#/////////////////////////////////////////////////////

# цикл while 

# num = 999
# sum = 0
# while num > 0:
#     sum += num % 10 
#     num //= 10
# print(sum)