"""Задача No41. Решение в группах
Дан массив, состоящий из целых чисел. Напишите программу, которая в данном массиве 
определит количество элементов, у которых два соседних и, при этом, оба соседних элемента 
меньше данного. Сначала вводится число N — количество элементов в массиве 
Далее записаны N чисел — элементы массива. Массив состоит из целых чисел.
Ввод: Ввод:
55
1 2 3 4 5 15151
Вывод: Вывод:
02
15 минут"""

def count_elements_with_smaller_neighbors():
    # Ввод массива
    n = int(input("Введите количество элементов в массиве: "))
    array = list(map(int, input("Введите элементы массива через пробел: ").split()))

    # Подсчет количества элементов с меньшими соседями
    count = 0
    for i in range(1, n-1):
        if array[i-1] < array[i] < array[i+1]:
            count += 1

    # Вывод результата
    print("Количество элементов, у которых два соседних элемента меньше данного:", count)

count_elements_with_smaller_neighbors()