"""Задача No45. Решение в группах
Два различных натуральных числа n и m называются дружественными, если сумма делителей 
числа n (включая 1, но исключая само n) равна числу m и наоборот. 
Например, 220 и 284 –0 дружественные числа. 
По данному числу k выведите все пары дружественных чисел, каждое из которых не превосходит k. 
Программа получает на вход одно натуральное число k, не превосходящее 105. 
Программа должна вывести все пары дружественных чисел, каждое из которых не превосходит k. 
Пары необходимо выводить по одной в строке, разделяя пробелами. 
Каждая пара должна быть выведена только один раз (перестановка чисел новую пару не дает).
Ввод: Вывод:
300 220 284
10 минут"""

def find_friendly_numbers(k):
    results = []
    for n in range(2, k+1):
        m = sum_of_divisors(n)
        if m > n and sum_of_divisors(m) == n:
            results.append((n, m))
    return results

def sum_of_divisors(n):
    divisors = [1]
    for i in range(2, int(n**0.5) + 1):
        if n % i == 0:
            divisors.append(i)
            if i != n // i:
                divisors.append(n // i)
    return sum(divisors)

k = int(input("Введите число k: "))
friendly_numbers = find_friendly_numbers(k)

print("Пары дружественных чисел не превосходящих", k)
for pair in friendly_numbers:
    print(*pair)