# Задача 22:
"""Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 
Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
Пользователь вводит 2 числа. n — кол-во элементов первого множества. 
m — кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств."""

def find_common_elements():
    # Ввод первого множества
    n = int(input("Введите количество элементов первого множества: "))
    set1 = set(map(int, input("Введите элементы первого множества через пробел: ").split()))

    # Ввод второго множества
    m = int(input("Введите количество элементов второго множества: "))
    set2 = set(map(int, input("Введите элементы второго множества через пробел: ").split()))

    # Нахождение общих элементов и сортировка
    common_elements = sorted(set1.intersection(set2))

    # Вывод результатов
    print("Общие элементы в обоих множествах, в порядке возрастания:")
    print(*common_elements)

find_common_elements()