"""Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

*Пример:*

5
    1 2 3 4 5
    3
    -> 1
"""
# def count_occurrences(A, X):
#     count = 0
#     for num in A:
#         if num == X:
#             count += 1
#     return count

# Ввод данных
# N = int(input("Введите количество элементов в массиве: "))
# A = list(map(int, input("Введите элементы массива через пробел: ").split()))
# X = int(input("Введите число X: "))

# # Подсчет количества вхождений числа X
# occurrences = count_occurrences(A, X)

# # Вывод результата
# print("Число X встречается", occurrences, "раз(а) в массиве A.")


list_1 = [1, 2, 3, 4, 5]
k = 3
count = 0
for i in range(list_1):
    if list_1[i] == k:
        count += 1
print(count)