"""Определите, можно ли от шоколадки размером a × b долек отломить c долек, 
если разрешается сделать один разлом по прямой между дольками 
(то есть разломить шоколадку на два прямоугольника).

Выведите yes или no соответственно."""

# a = 3
# b = 2
# c = 1
# n = (a*b)//3
# if c >= n:
#     print('yes')
# else:
#     print('no')




a = 1
b = 1
c = 1

# Введите ваше решение ниже

if c == (a*b-b) or c == (a*b-b) or c == a*b-a :
    print('yes')
elif c == a and c == b:
    print('yes')  
else:
    print('no')


