# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек 
# отломить k долек, если разрешается сделать один разлом по прямой между 
# дольками (то есть разломить шоколадку на два прямоугольника).
# *Пример:*
# 3 2 4 -> yes
# 3 2 1 -> no

print("Введите дольки для проверки: ")
n, m, k = map(int, input().split())

# Проверяем, можно ли отломить k долек
if k % 2 == 0 and k != n * m:
    print("yes")
else:
    print("no")