"""Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. 
Она растёт на круглой грядке, причём кусты высажены только по окружности. 
Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло 
различное число ягод — на i-ом кусте выросло ai ягод.
В этом фермерском хозяйстве внедрена система автоматического сбора черники. 
Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, 
собирает ягоды с этого куста и с двух соседних с ним.
Напишите программу для нахождения максимального числа ягод, которое может собрать 
за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки."""

def max_berry_count(berries):
    n = len(berries)
    max_count = 0

    for i in range(n):
        curr_count = berries[i] + berries[(i+1)%n] + berries[(i-1)%n]
        max_count = max(max_count, curr_count)

    return max_count

# Ввод числа кустов и числа ягод на каждом кусте
n = int(input("Введите количество кустов: "))
berries = list(map(int, input("Введите количество ягод на каждом кусте через пробел: ").split()))

# Нахождение максимального числа ягод
max_berries = max_berry_count(berries)

# Вывод результата
print("Максимальное число ягод, которое может быть собрано за один заход:", max_berries)