"""Дано натуральное число. Выведите его последнюю цифру.

Входные данные
Вводится натуральное число.

Выходные данные
Выведите ответ на задачу."""

x = int(input("Введите число: "))
print(x%10)