"""
Задача №2944. Сумма цифр
Дано трехзначное число. Найдите сумму его цифр.

Входные данные
Вводится трехзначное число.

Выходные данные
Выведите ответ на задачу."""

x = int(input("Введите число: "))
a = x%10 # выводим остаток последнюю цифру числа 
b = x//10%10 # выводим втрою цифру
c = x//100 # выводим первую йиру
print(a)
print(b)
print(c)
print(a+b+c)