"""Задача №2936. Гипотенуза
Дано два числа a и b. Найдите гипотенузу треугольника с заданными катетами.

Входные данные
В двух строках вводятся два числа (числа целые,положительные, не превышают 1000).

Выходные данные
Выведите ответ на задачу."""

import math
a = int(input("Введите катет a: "))
b = int(input("Введите катет b: "))
c = (a**2) + (b**2)
print(math.sqrt(c))