"""В шкатулке хранится разноцветный бисер (или бусины). Все бусины имеют одинаковую форму, 
размер и вес. Бусины могут быть одного из N различных цветов. В шкатулке много бусин каждого цвета.

Требуется определить минимальное число бусин, которые можно не глядя вытащить из шкатулки 
так, чтобы среди них гарантированно были две бусины одного цвета.

Входные данные
Входной файл INPUT.TXT содержит одно натуральное число N - количество цветов бусин (1 ≤ N ≤ 109).

Выходные данные
В выходной файл OUTPUT.TXT выведите ответ на поставленную задачу."""

# Чтение входных данных

N = int(input())
print(N + 1)