"""Задача №2943. Число десятков
Дано неотрицательное целое число. Найдите число десятков в его десятичной записи 
(то есть вторую справа цифру его десятичной записи).

Входные данные
Вводится неотрицательное целое число.

Выходные данные
Выведите ответ на задачу."""

x = int(input("Введите число: "))
x = x//10%10
print(x)