"""адача №2949. Обмен значений
Напишите программу, которая считывает значения двух целочисленных переменных a и b, 
затем меняет их значения местами (то есть в переменной a должно быть записано то, 
что раньше хранилось в b, а в переменной b записано то, что раньше хранилось в a). 
Затем выведите значения переменных.

Входные данные
Вводятся целые числа a и b.

Выходные данные
Выведите ответ на задачу.

Примечание
Решением задачи не является такой код:

a = input ()
b = input ()
print (b, a)"""

a = int(input("Введите 1 число: "))
b = int(input("Введите 2 число: "))
print(a,b)
t = a
a = b
b = t
print(a,b)

