"""Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали 
одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем 
Петя и Сережа вместе?

Входные данные
В единственной строке входного файла INPUT.TXT записано одно натуральное
 число S – общее количество сделанных журавликов (S < 106).

Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести три числа, 
разделенных пробелами – количество журавликов, которые сделал каждый ребенок 
(Петя, Катя и Сережа)."""

# (x + x) + 4x = s
# 6x = s
# x = s/6

n = int(input())
a = n // 6
b = a
c = (a + b) * 2
print(a, c, b)