"""Задача №2939. Дележ яблок - 2
N школьников делят K яблок поровну, неделящийся остаток остается в корзинке. 
Сколько яблок останется в корзинке?

Входные данные
Программа получает на вход числа N и K.

Выходные данные
Программа должна вывести искомое количество яблок."""

x = int(input("Введите кол-во школьников: "))
y = int(input("Введите кол-во яблок: "))
print(y%x)