# Задача: вводятся числа пока не введут 0. Найти произведение четных чисел. 

############################################

# Вариант 1

# mult = 1
# while True: # бесконечный цикл
#     namber = int(input('Введите число: ')) # запрос ввода числа пользователем с консоли
#     if namber == 0: # проверка условия для завершения цикл
#         break # прерывание цикла если условие истинно 
#     if namber % 2 == 0: #проверка числа на четность. Остаток от деления на 2 будет равен
#         mult *= namber # после проверки на четность умножаем четное число namber на 1
# print(mult)

############################################

# Вариант 2

# mult = 1
# namber = int(input("Введите число: ")) # запрос ввода числа вне цикла
# while namber != 0: # заходим в цикл и сразу же проверяем не равно ли оно нулю. 
#     if namber % 2 == 0: #проверка числа на четность. Остаток от деления на 2 будет равен 0
#         mult *= namber # после проверки на четность умножаем четное число namber на 1
#     namber = int(input("Введите число: "))
# print(mult)

############################################

# some_str = "Hello world"
# for letter in some_str:
#     print(letter)

############################################

# for namber in 1, 2, 3, 6, 5, 4, 7, 8, 9: # тип данных кортеж
#     if namber % 3 == 0:
#         print(namber)

##########################################

# for el in range(10): # создание упорядочного списка элементов от 0 до 9 (не включая последний)
#     print(el)

#############################################

# for el in range(2, 10): # 
#     print(el)

##################################

# for el in range(2, 10, 3): # 
#      print(el)
###############################

# for el in range(10, 2, -3): # 
#      print(el)

##################################

# some_str = "Hello world"
# for ind in range(0, len(some_str)):
#     print(some_str[ind])

#####################################

for i in range(0, 10):
    print("hello")