"""Задача №9. Решение в группах
По данному целому неотрицательному n вычислите
значение n!. N! = 1 * 2 * 3 * … * N (произведение всех
чисел от 1 до N) 0! = 1 Решить задачу используя цикл
while
Input: 5
Output: 120"""

n = int(input("Введите число: "))
mul = 1 # переменная для хранения значений факториала
while n > 1: # цикл пока n > 1
    mul *= n # действие у
    n -= 1
print(mul)
