"""Иван Васильевич пришел на рынок и решил купить два арбуза: один для себя, а другой для тещи. 
Понятно, что для себя нужно выбрать арбуз потяжелей, а для тещи полегче. Но вот незадача: 
арбузов слишком много и он не знает как же выбрать самый легкий и самый тяжелый арбуз? Помогите ему!
Пользователь вводит одно число N – количество арбузов. Вторая строка содержит N чисел, 
записанных на новой строчке каждое. Здесь каждое число – это масса соответствующего арбуза. Все числа натуральные и не превышают 30000."""

from random import randint

N = int(input("Введите количество арбузов: "))
w = []

for i in range(N):
    weigth = randint(1000, 3000)
    w.append(weigth)

print(f"Веса всех арбузов - {w}")
print(f"Самый легкий арбуз весит {min(w)}")
print(f"Самый тяжелый арбуз весит {max(w)}")

