# mult = 1
# while True: # бесконечный цикл
#     namber = int(input('Введите число: ')) # запрос ввода числа пользователем с консоли
#     if namber == 0: # проверка условия для завершения цикл
#         break # прерывание цикла если условие истинно 
#     if namber % 2 == 0: #проверка числа на четность. Остаток от деления на 2 будет равен
#         mult *= namber # после проверки на четность умножаем четное число namber на 1
# print(mult)

mult = 1
namber = int(input("Введите число: ")) # запрос ввода числа вне цикла
while namber != 0: # заходим в цикл и сразу же проверяем не равно ли оно нулю. 
    if namber % 2 == 0: #проверка числа на четность. Остаток от деления на 2 будет равен 0
        mult *= namber # после проверки на четность умножаем четное число namber на 1
print(mult)