'''Даны два массива чисел. Требуется вывести те элементы
первого массива (в том порядке, в каком они идут в первом
массиве), которых нет во втором массиве. Пользователь вводит
число N - количество элементов в первом массиве, затем N
чисел - элементы массива. Затем число M - количество
элементов во втором массиве. Затем элементы второго массива
Ввод: Вывод:
7 3 3 2 12
3 1 3 4 2 4 12
6
4 15 43 1 15 1 (каждое число вводится с новой строки)
'''
from random import randintn 

namber1 = int(input("Введиче кол-во эл 1 списка: "))
list_1 = [randint(0,10) for _ in range(namber1)]
namber2 = int(input("Введиче кол-во эл 1 списка: "))
list_2 = [randint(0,10) for _ in range(namber2)]
print(list_1)
print(list_2)

list_3 = []

for item in list_1: # Прошлись по первому списку циклом фор
    if item not in list_2: # проверяем есть ли элеммнеты списка 1 в списке 2
        list_3.append(item) # записываем эти элмеенты в новый список
print(list_3)



