# Дан список чисел. Определите, сколько в нем
# встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6

# Задача №19. Решение в группах
# Дана последовательность из N целых чисел и число
# K. Необходимо сдвинуть всю последовательность
# (сдвиг - циклический) на K элементов вправо, K –
# положительное число.
# Input: [1, 2, 3, 4, 5] k = 2
# Output: [4, 5, 1, 2, 3]

list_1 = [1, 1, 2, 3, 3, 4, 5] # создаем список с заполенными значениями
list_2 = []
for i in list_1:
    if i not in list_2:
        list_2.append(i)
    print(len(list_2))
