"""Задача 30:  Заполните массив элементами арифметической прогрессии. Её первый элемент, 
разность и количество элементов нужно ввести с клавиатуры. Формула для получения n-го члена
 прогрессии: an = a1 + (n-1) * d.
Каждое число вводится с новой строки."""

# Ввод значений с клавиатуры
a1 = int(input("Введите первый элемент прогрессии: "))
d = int(input("Введите разность прогрессии: "))
n = int(input("Введите количество элементов: "))

# Создание и заполнение списка элементами арифметической прогрессии
progression = [a1 + (i-1) * d for i in range(1, n+1)]

# Вывод списка на экран
print("Массив элементов арифметической прогрессии:")
for num in progression:
    print(num)