list_1 = [] # создаем пустой список
list_1 = list() # создаем функциию list которая так же создает пустой список
print(list_1) # вывод результата с пустыми скобками
list_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9,] # создаем список с заполенными значениями
print(*list_1) # символ * убирает квадратные скобочки в выводе
for i in list_1: # цикл for
    print(i) # поочередно выводит все элементы списка

print(len(list_1)) # узнаем длинну списка и выводим значение длинны на экран
print(list_1[0]) # вывод на экран значения элемента с указанным индексом
print(list_1[-1]) # индексация списка с конца

#

list_1 = [1, 5]
print(list_1)
list_1.append(8) # функция .append позволяет добавить новый элемент в список 

#

list_1 = []
for i in range(5):
    list_1.append(i)
    print(list_1)

# Удаление последнего элемента
list_1 = [1, 2 ,3, 4, 5]
print(list_1.pop()) # функция .pop удалет последнее значение элемента 
# (также вохвращает значение)

# Удаление последнего элемента
list_1 = [1, 2 ,3, 4, 5]
print(list_1.pop(0)) # функция .pop удалет элемент с указаннымм индексом 
# (так же возвращает значение)

# Добавление элемента списка на нужную позицию
list_1 = [1, 2 ,3, 4, 5]
print(list_1.insert(2, 11)) # принимает на вход два аргумента. 
# Позицию и значение. 

# Срезы списков
list_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9]
print(list_1[0]) # вывод первого элемента списка
print(list_1[1]) # вывод второго элемента списка
print(list_1[len(list_1)-1]) # вывод последнего элемента
print(list_1[-1]) # вывод последнего элемента
print(list_1[-5]) # вывод 5 элемента c конца
print(list_1[:]) # вывод всего списка 
print(list_1[:2]) # начинаем сначала и выводим до указанного индекса
print(list_1[len(list_1)-2:]) # вывод последних 2 элементов
print(list_1[2:5]) # вывод значений в указанном интервале
print(list_1[0:len(list_1):6]) # идем с начала до конца с шагом 6
print(list_1[::6]) # то же самое

# Кортеж - не изменяемый список
t = () # создаем пустой кортеж
print(type(t)) # вывод класса 
