"""В отделе работают 3 сотрудника, которые получают заработную плату в рублях. 
Требуется определить: на сколько зарплата самого высокооплачиваемого из них 
отличается от самого низкооплачиваемого.

Входные данные
В единственной строке входного файла INPUT.TXT записаны размеры зарплат всех 
сотрудников через пробел. Каждая заработная плата – это натуральное число, не превышающее 105.

Выходные данные
В выходной файл OUTPUT.TXT необходимо вывести одно целое число — разницу между 
максимальной и минимальной зарплатой.

Примеры"""

x, y, z = map(int, input().split()) # 100 500 1000
m_max = max(x, y, z) 
m_min = min(x, y, z)
rez = m_max - m_min
print(rez)