"""Белочка собрала в лесу N шишек c орешками. Белочка очень привередливо выбирала шишки, 
и брала только те, в которых ровно M орешков. Также известно, что для пропитания зимой 
ей необходимо не менее K орешков. Определите, хватит ли на зиму орешков белочке.

Входные данные
Первая строка входного файла INPUT.TXT содержит три натуральных числа через 
пробел: N, M и K (N, M ≤ 100, K ≤ 10 000).

Выходные данные
В выходной файл OUTPUT.TXT выведите «YES» если белочке хватит орешков и «NO» в противном случае.

Примеры"""

n, m, k = map(int, input().split())
if n*m >= k:
    print('YES')
else:
    print('NO')